<?php

namespace Faker\AlgeriaProvider\ar_DZ;

class Person extends \Faker\Provider\Person {
    
    protected static $maleNameFormats = [
        '{{firstNameMale}} {{lastName}}',
    ];

    protected static $femaleNameFormats = [
        '{{firstNameFemale}} {{lastName}}',
    ];

    protected static $firstNameMale = [
        'محمد', 'أمين', 'سمير', 'منير', 'عبدو', 'أحمد', 'صلاح', 'أسامة', 'زكرياء', 'عمار', 'شعبان',
        'يوسف', 'لطفي', 'مسعود', 'إسلام', 'ياسين', 'عادل', 'سامي', 'عبد الرحمان', 'فضيل', 'نسيم', 'طه',
        'مولود', 'مهدي', 'وليد', 'سليم', 'إلياس', 'نذير', 'خليل', 'فاتح', 'حمزة', 'أكرم', 'أنيس',
        'أيوب', 'أيمن', 'بلال', 'إبراهيم', 'عبد العزيز', 'جمال', 'عبد القادر', 'فريد', 'مالك', 'مصطفى', 'موسر', 'حسين',
        'يحى', 'خالد', 'آدم', 'رؤوف', 'علي', 'مراد',
    ];

    protected static $firstNameFemale = [
        'ياسمين', 'إيمان', 'صابرينة', 'إيناس', 'لينة', 'سارة', 'ميليسا', 'نور', 'أسماء', 'هدى',
        'أمينة', 'شراز', 'سيليا', 'دنيا', 'رانيا', 'منال', 'مريم', 'أمل', 'ماريا', 'فرح',
        'ميرة', 'فريال', 'ليسا', 'سلمى', 'فوزية', 'ريم', 'داليا', 'سميرة', 'مايا', 'تينهينان',
        'آية', 'هاجر', 'إكرام', 'ناريمان', 'إلهام', 'نجمة', 'سيرين', 'كاتية', 'خديجة', 'سعاد',
        'فاطمة', 'زينة', 'سمية', 'فريدة', 'حنان', 'ليلى', 'جميلة', 'ريمة', 'صوفيا', 'بشرى',
        'هنية', 'ملك', 'حياة', 'زينب', 'بتول', 'نسرين', 'يسرى', 'مروة', 'دعاء',
        'نوال',
    ];

    protected static $lastName = [
        'سعيدي', 'سليماني', 'تواتي', 'منصوري', 'براهيمي', 'ميساوي', 'حداد', 'يحياوي', 'رحماني', 'دحماني', 'صحراوي', 'بن عيسى',
        'موساوي', 'صالحي', 'بوزيان', 'سعدي', 'عيساوي', 'بن يحى', 'بلحاج', 'عمارة', 'عباس', 'مرابط', 'مختاري', 'طالب', 'بوزيد',
        'مباركي', 'خالدي', 'بوزيدي', 'حاجي', 'زيتوني', 'حامدي', 'حميدي', 'طالبي', 'شريفي', 'قادري', 'بوراس', 'عابد', 'تومي', 'بلعيد',
        'بن علي', 'عاشور', 'طيبي', 'شايب', 'العربي', 'شرقي', 'زياني', 'ناصري', 'مداني', 'بالعربي', 'يوسفي', 'قاذي', 'بوخالفة', 'عبيد',
        'قاسمي', 'بن سالم', 'عبدلي', 'عماري', 'عزوز', 'زيدي', 'عراب', 'مزيان', 'داودي', 'عمراني', 'خليفة', 'شريف', 'زاوي', 'عامر',
        'زروقي', 'سلطاني', 'حساني', 'بلقاسم', 'هاشمي', 'خليفي', 'سالمي', 'رحال', 'بن عمارة', 'محمودي', 'زيان', 'حمادي', 'عياد',
        'دحمان', 'بوخاري', 'عبدي', 'منصور', 'ذيب', 'لعايب', 'زواوي', 'داود', 'قاسم', 'شعبان', 'فرحات', 'رمضاني', 'بن أحمد', 'حمزة',
        'لطرش', 'بن عمر', 'رحموني', 'هواري', 'بن سعيد', 'سعودي', 'عبد اللاوي', 'ضيف', 'صديقي', 'بوذراع', 'قدور', 'غربي', 'بركان',
        'لعمري', 'بومعزة', 'مخلوف', 'صياح', 'بوعزيز', 'عزيزي', 'مقراني', 'عباس', 'لعور', 'مخلوفي', 'عبو', 'قارة', 'سعيد', 'ميلودي',
        'بلقاسمي', 'براهمي', 'عبد العزيز', 'سعيداني', 'محمدي', 'عمران', 'بن عودة', 'والي', 'بالعيدي', 'عيساني', 'مزياني', 'علالي',
        'بوجمعة', 'بن يوسف', 'زيدان', 'مراح', 'نوري', 'فلاح', 'سنوسي', 'قبايلي', 'لوصيف', 'بوشارب', 'قندوز', 'لكحل', 'حجاج',
        'مكي', 'يحى', 'جودي', 'بلقاضي', 'شاوي', 'عدة', 'جبار', 'بهلول', 'طويل', 'بوسعيد', 'بوقرة', 'لخضاري', 'بركاني',
        'عماري', 'حمزاوي', 'صلاح', 'بوطالب', 'غربي', 'هامل', 'حمادي', 'سالم', 'بختي', 'زروال', 'هني', 'نايلي', 'مرزوق', 'بحري',
        'بوعزة', 'يحى', 'طاهري', 'مداح', 'حمودي', 'معزوز', 'لعريبي', 'مولاي', 'بوعلي', 'مالكي', 'شارف', 'بوبكر', 'عباد', 'بلخير',
        'بكوش', 'قسوم', 'بن صلاح', 'عمري', 'بن عامر', 'باشا', 'مرزوقي', 'بلخيري', 'سلامي', 'ميهوبي', 'بوعلام', 'قاسي', 'ساهلي',
        'بومدين', 'بوعافية', 'بن موسى', 'موسى', 'ميموني', 'بن يمينة', 'ماحي', 'مقران', 'عثماني', 'غازي', 'رابحي', 'حسين', 'عاشوري',
        'شيخ', 'رحمون', 'جلال', 'فارس', 'عيادي', 'شيباني', 'بورحلة', 'نوار', 'قدوري', 'شيخ', 'باي', 'خالد', 'حامدوش', 'كبير',
        'بوستة', 'بغدادي', 'درويش', 'صبري', 'دربال', 'خليل', 'بن عبدالله', 'رايس', 'عباسي', 'لكحل', 'معوش', 'مفتاح',
        'بوناب', 'عطية', 'فيلالي', 'بالبشير', 'معزوزي', 'مناد', 'إخلاف', 'ساعد', 'حدوش', 'مقدام', 'ناصر', 'حمداني', 'عبادة',
        'طهراوي', 'ماذي', 'مرسلي', 'قويدري', 'سماعيل', 'عمروش', 'مصباح', 'بطاهر', 'خدير', 'ثابت', 'بوشمة', 'علال', 'مجاهد',
        'ساسي', 'دركاوي', 'أوشان', 'خليف', 'بوضياف', 'مالك', 'سوداني', 'لحمر', 'بن عيشة', 'بن الشيخ', 'بن زيان', 'لونيس',
        'بوخاتم', 'عبده', 'بو عبدالله', 'ربيعة', 'بن سليمان', 'نجار', 'عريبي', 'ابركان', 'كمال', 'بلخير', 'مهدي', 'سحنون',
        'سيد', 'حمودي', 'سبتي', 'مهدي', 'بن براهيم', 'عبيدي', 'ايدير', 'حسناوي', 'شاوش', 'وضاح', 'غول', 
    ];

    protected static $titleMale = ['السيد', 'الدكتور', 'البروفيسور'];

    protected static $titleFemale = ['السيدة', 'الآنسة', 'الدكتورة', 'البروفيسورة'];

}